Revit 2015 API
BoundarySegment Class
An object that represents a segment of a room boundary.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class BoundarySegment : APIObject
Visual Basic
Public Class BoundarySegment _
	Inherits APIObject
Visual C++
public ref class BoundarySegment : public APIObject
Remarks
These objects define the exterior boundary of a room. The geometry of the segment can be retrieved along with the element that is responsible for producing that boundary.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Architecture.BoundarySegment
See Also
BoundarySegment Members
Autodesk.Revit.DB.Architecture Namespace